Autodesk.Revit.DB.Electrical.PanelScheduleData.SetBorderAroundSchedule(Autodesk.Revit.DB.ElementId)
Adds a border around the schedule
borderId:
The border to set around the schedule
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.PanelScheduleData.SetBorderAroundSections(Autodesk.Revit.DB.ElementId)
Adds a border around the sections
borderId:
The border to set around the sections
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.PanelScheduleData.AddLoadClassification(Autodesk.Revit.DB.ElementId)
Add a Load Classification Id to the array of Load Classifications.
loadClassficationId:
The load classification to add
Returns:
True if success; false if the given Id has already existed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.PanelScheduleData.SetLoadClassifications(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Sets the Load Classifications associated with this panel schedule
loadClassificaions:
The load classifications to assign
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.PanelScheduleData.UpdateCircuitTableForInstance(Autodesk.Revit.DB.FamilyInstance)
Redraw the circuit table for the given panel with the given parameter updates
pPanel:
The panel that this circuit table is being drawn for
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Electrical.PanelScheduleData.IsUnusedPhaseHidden
True if the user wishes to hide the unused phase column of a single phase panel, false otherwise.
Since:
2021

Autodesk.Revit.DB.Electrical.PanelScheduleData.IsAutoShadingForLoadDisplay
Display shading of load cells automatically or not.
Since:
2022